testCase/pendulam_withoutAdaptiveRefinement/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{


   sides
    {
        type            zeroGradient;
    }
    inlet
    {
        type    fixedValue;
        value   uniform 0;
    }

    outlet
    {
        type   zeroGradient;
	}

	
    ballOut
    {
        type            overset;
        
    }

    ballIn
    {
      type   zeroGradient;
    }


	frontAndBack
	{
		type empty;	
	}


}


// ************************************************************************* //
